checkfree/src/test/resources/expected/execute/test_helloworld_greetMe.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://apache.org/hello_world_soap_http/types"><SOAP-ENV:Header/><SOAP-ENV:Body><ns0:greetMe><ns0:requestType>a</ns0:requestType></ns0:greetMe></SOAP-ENV:Body></SOAP-ENV:Envelope>